app/Controllers/Home.php

    public function index()
    {
        session();
        $data = [
            'validation'    => \config\Services::validation(),
            'matakuliah'  => $this->matakuliahModel->asObject()->findAll()
---
SELECT *
FROM `matakuliah`

    public function store()
    {
        if (!$this->validate([
            'nim'   => 'required',
            'ip_address'   => 'required',
            'id_matakuliah'   => 'required'
        ])) {
            $validation = \config\Services::validation();
            return redirect()->to('/')->withInput()->with('validation', $validation);
        }

        $nim = $this->request->getVar('nim');
        $id_matakuliah = $this->request->getVar('id_matakuliah');
        $ip_address = $this->request->getVar('ip_address');

        $matakuliah = $this->matakuliahModel->where('id', $id_matakuliah)->asObject()->first();

        $jadwal_absensi = $matakuliah->jadwal_absensi;

        $jadwal_absensi = date('Y-m-d ' . $jadwal_absensi);
        if (date('Y-m-d H:i') <= $jadwal_absensi) {
            return redirect()->to('/')->with('error', "presensi gagal, belum waktu untuk jadwal absensi");
        }

        $mahasiswa = $this->mahasiswaModel->where('nim', $nim)->asObject()->first();
        if (!empty($mahasiswa)) {
            $mahasiswa_id = $mahasiswa->id;
            $presensi = $this->presensiModel->where('id_matakuliah', $id_matakuliah)->where('ip_address', $ip_address)->asObject()->first();
---
SELECT *
FROM `matakuliah`
WHERE `id` = '6'
 LIMIT 1
SELECT *
FROM `mahasiswa`
WHERE `nim` = '21110805'
 LIMIT 1
SELECT *
FROM `presensi`
WHERE `id_matakuliah` = '6'
AND `ip_address` = '114.5.213.236'
 LIMIT 1

                'ip_address' => $ip_address,
                'status' => 1,
            ];
            $this->presensiModel->insert($data);
---
INSERT INTO `presensi` (`id_matakuliah`, `id_mahasiswa`, `ip_address`, `status`) VALUES ('6', '6', '114.5.213.236', 1)