app/Controllers/MatakuliahController.php

SELECT *
FROM `matakuliah`
---
    public function index()
    {
        $data = [
            'matakuliah'  => $this->matakuliahModel->asObject()->findAll()
        ];