app/Models/MatakuliahModel.php

    public function updateData($id, $data)
    {
        $this->db->table('matakuliah')->where('id', $id)->update($data);
---
UPDATE `matakuliah` SET `nama_matakuliah` = 'Interaksi Manusia dan Komputer', `jadwal_absensi` = '22:00:00'
WHERE `id` = '6'